/*********************************************************
 * 分布を表示する関数
 *********************************************************/
showGraph = function(ary) {
  /**************************************
   * 0, 10, 20, ... , 90, 100 から9点ずつ調べる
   **************************************/
  for (var basePoint = 0; basePoint <= 100; basePoint+=10) {
    // basePoint点～basePoint+9点の人数を取得
    var count = getRangeCount(ary, basePoint, basePoint+9);
    // (おまけ。発想が至らなくてもよい)
    // 項目名を揃えるため、
    // 0点の場合は空白2文字、
    // 10～90点の場合は空白1文字を先頭におぎなう
    var message = '';
    if (basePoint == 0) {
      message = '  0';
    }
    else if (10 <= basePoint && basePoint <= 90) {
      message = ' '+basePoint;
    }
    else {
      message += basePoint;
    }

    // 項目名とグラフの区切り
    message += ' ';

    // 人数分、| を追加する
    for (var index = 0; index < count; index++) {
      message += '|';
    }

    // 表示
    console.log(message);

  }
};

/*********************************************************
 * 指定した範囲の点数をとった人数を返す関数
 * (ただし、範囲とは min 点～ max 点であり、
 *  min 点、max 点をとった人を含む)
 *********************************************************/
getRangeCount = function(ary, min, max) {
  var count = 0;
  for (var index = 0; index < ary.length; index++) {
    if (min <= ary[index] && ary[index] <= max) {
      count++;
    }
  }
  return count++;
};


showGraph([81, 88, 89, 88, 45, 55, 65, 0, 94, 28, 34, 49, 0, 74, 100, 97, 40, 69, 35, 48, 47, 98, 41, 2, 10, 84, 75, 64, 95, 20, 43, 56, 100, 87, 58, 31, 91, 87, 91, 10, 68, 51, 16, 68, 56, 47, 73, 59, 65, 66, 15, 22, 62, 70, 27, 60, 10, 39, 74, 78, 15, 46, 38, 18, 27, 69, 55, 96, 60, 7, 51, 47, 27, 27, 10, 24, 11, 16, 9, 16, 13, 15, 3, 82, 26, 90, 43, 63, 57, 25, 2, 15, 53, 19, 43, 64, 49, 17, 19, 41]);
